-> $X
<~ [MSG:INFO: Caution: Unlocked]
<- ok
-> $G
<- [GC:G0 G54 G17 G21 G90 G94 M5 M9 T0 F0 S0]
<- ok
-> (print, Cur tool=%d#<_current_tool>, Sel tool=%d#<_selected_tool>)
<- [MSG:INFO: PRINT, Cur tool=-1 Sel tool=0]
<- ok
-> T1
<- ok
-> $G
<- [GC:G0 G54 G17 G21 G90 G94 M5 M9 T1 F0 S0]
<- ok
-> (print, Cur tool=%d#<_current_tool>, Sel tool=%d#<_selected_tool>)
<- [MSG:INFO: PRINT, Cur tool=-1 Sel tool=1]
<- ok
-> M6
<- ok
-> $G
<- [GC:G0 G54 G17 G21 G90 G94 M5 M9 T1 F0 S0]
<- ok
-> (print, Cur tool=%d#<_current_tool>, Sel tool=%d#<_selected_tool>)
<- [MSG:INFO: PRINT, Cur tool=1 Sel tool=1]
<- ok
-> M6T2
<- ok
-> $G
<- [GC:G0 G54 G17 G21 G90 G94 M5 M9 T2 F0 S0]
<- ok
-> (print, Cur tool=%d#<_current_tool>, Sel tool=%d#<_selected_tool>)
<- [MSG:INFO: PRINT, Cur tool=2 Sel tool=2]
<- ok
-> (print, Cur tool=%d#<_current_tool>)
<- [MSG:INFO: PRINT, Cur tool=2]
<- ok
-> (print, Sel tool=%d#<_selected_tool>)
<- [MSG:INFO: PRINT, Sel tool=2]
<- ok
-> M61Q3
<- ok
-> $G
<- [GC:G0 G54 G17 G21 G90 G94 M5 M9 T3 F0 S0]
<- ok
-> (print, Cur tool=%d#<_current_tool>, Sel tool=%d#<_selected_tool>)
<- [MSG:INFO: PRINT, Cur tool=3 Sel tool=3]
<- ok
-> M6T0
<- ok
-> $G
<- [GC:G0 G54 G17 G21 G90 G94 M5 M9 T0 F0 S0]
<- ok
-> (print, Cur tool=%d#<_current_tool>, Sel tool=%d#<_selected_tool>)
<- [MSG:INFO: PRINT, Cur tool=0 Sel tool=0]
<- ok