-> #<a> = 1
<- ok
-> #<b> = 2
<- ok
-> (print, #<a>)
<- [MSG:INFO: PRINT, 1.000000]
<- ok
-> (print, #<b>)
<- [MSG:INFO: PRINT, 2.000000]
<- ok
-> #<c> = [#<a>+#<b>]
<- ok
-> (print, #<c>)
<- [MSG:INFO: PRINT, 3.000000]
<- ok
-> o100 if [#<c> EQ 3]
<- ok
-> (print, c is 3 - pass)
-> o100 else
-> (print, c is not 3 - fail)
-> o100 endif
<- [MSG:INFO: PRINT, c is 3 - pass]
<- ok
